[
  {
    "name": "Yvonne Copeland",
    "profile_url": "https://www.rula.com/providers/AL/1881336980-yvonne-copeland",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/21-04-2025_Yvonne_Copeland_1881336980",
    "city": "Sylacauga, AL",
    "bio": "I realize that the decision to begin therapy can be difficult. Often, we postpone the decision because we hesitate to prioritize our own needs. I acknowledge the importance of this initial action step, and I pledge to support you as you work toward your therapy goals. I will focus on your needs throughout the process and will collaborate with you in partnership in order to establish the best framework to enable you to achieve your goals. When you are ready, we will begin this journey together.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Linda Walker",
    "profile_url": "https://www.rula.com/providers/AL/1841937273-linda-walker",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/03-09-2025_Linda_Walker_1841937273",
    "city": "Birmingham, AL",
    "bio": "I understand that reaching out for support takes a lot of courage. Life can be overwhelming and challenging, and you do not have to face these challenges alone. I am here to provide a safe, compassionate, and nonjudgmental space where you can explore your thoughts and emotions.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Lillie Flowers",
    "profile_url": "https://www.rula.com/providers/AL/1851834519-lillie-flowers",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/02-09-2025_Lillie_Flowers_1851834519",
    "city": "Alabama",
    "bio": "I am dedicated to helping individuals and families navigate life's challenges with compassion and practical support. Through counseling, advocacy and resource connection, I empower clients to build resilience, improve well-being and thrive. My mission is to meet people where they are and guide them to where they want to be.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Mary McDonald",
    "profile_url": "https://www.rula.com/providers/AL/1982586616-mary-mcdonald",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/25-08-2025_Mary_McDonald_1982586616",
    "city": "Tuscaloosa, AL",
    "bio": "Let’s face it, life can be messy, unpredictable, and sometimes downright overwhelming. The good news? You don’t have to sort through it alone. I work with individuals, couples, and families to untangle the knots of anxiety, depression, trauma, relationship hiccups, and those “what am I doing with my life” moments. My style is warm, down-to-earth, and tailored to you. Because healing isn’t one size fits all. When you're ready, I'm here to help you make sense of the chaos, celebrate your wins (big and small), and move toward the life you want at your own pace.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Isabella Ashley",
    "profile_url": "https://www.rula.com/providers/AL/1710646104-isabella-ashley",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/08-09-2025_Isabella_Ashley_1710646104",
    "city": "Alabama",
    "bio": "Welcome to Your Counselor’s Corner—a safe space for healing, growth, and connection! I help individuals navigate life’s challenges with compassion and practical tools, empowering you to find clarity, resilience, and peace. Together, we’ll work toward creating the meaningful change you’re seeking.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Shamari Grayson",
    "profile_url": "https://www.rula.com/providers/AL/1962852467-shamari-grayson",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/11-06-2025_Shamari_Grayson_1962852467",
    "city": "Northport, AL",
    "bio": "I am a Licensed Clinical Social Worker (LICSW) providing telehealth services to clients in the state of Alabama. My approach to therapy is supportive, client-centered, and solution-focused. I utilize active listening and a strengths-based approach to help individuals navigate depression, anxiety, stress, and life changes. I walk alongside my clients and provide guidance and tools to help improve their current state.",
    "next_appointment": null,
    "badges": [
      "LICSW",
      "9+ years",
      "Top provider",
      "Measures progress"
    ],
    "virtual": false
  },
  {
    "name": "Lynn Clark",
    "profile_url": "https://www.rula.com/providers/AL/1922741354-lynn-clark",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/23-04-2025_Lynn_Clark_1922741354",
    "city": "Rainbow City, AL",
    "bio": "I specialize in Clinical Mental Health and Addiction Counseling using a person-centered approach and the following modalities: ACT, Acceptance and Commitment Therapy, DBT, Dialectical Behavior Therapy, and CBT, Cognitive Behavior Therapy",
    "next_appointment": null,
    "badges": [
      "LPC",
      "Top provider"
    ],
    "virtual": false
  },
  {
    "name": "Aisha Cooper",
    "profile_url": "https://www.rula.com/providers/AL/1750985354-aisha-cooper",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/17-06-2024_Aisha_Cooper_1750985354",
    "city": "Montgomery, AL",
    "bio": "I am a licensed professional counselor #4662. My approach to therapy and focus areas center around Cognitive Behavioral Therapy. I feel this approach works best in challenging our thoughts in order to create the change that we need in our behaviors.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "3+ years",
      "Measures progress"
    ],
    "virtual": false
  },
  {
    "name": "Marion Stephen Clevenger",
    "profile_url": "https://www.rula.com/providers/AL/1871960112-marion-stephen-clevenger",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/25-08-2025_Marion%2BStephen_Clevenger_1871960112",
    "city": "Alabama",
    "bio": "Life is filled with bumps and bruises and is often difficult to make sense of at times. There are steps we can take to help ourselves find a new and fresh path on our journey. I personally want to congratulate you on taking this major first step forward. My approach to therapy is both from a Christian and a psychological approach. We will be exploring the root causes of our struggles while discussing viable solutions of how to live a healthy mental life, while looking forward to a productive and blessed future. I am here to offer you a safe and supportive environment. Reach out when you are ready to move forward. I am excited to hear from you and help you start your new journey.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Beryl Sabb",
    "profile_url": "https://www.rula.com/providers/AL/1689923237-beryl-sabb",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/15-09-2025_Beryl_Sabb_1689923237",
    "city": "Alabama",
    "bio": "I see therapy as a partnership—we’ll set goals that matter to you and adjust them as your needs change. My role is to give you support and tools so you can keep moving toward the life you want, even when things feel hard.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Kendra Rhodes",
    "profile_url": "https://www.rula.com/providers/AL/1982242756-kendra-rhodes",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/19-09-2025_Kendra_Rhodes_1982242756",
    "city": "Alabama",
    "bio": "Hey there, welcome aboard to your counseling journey! 🌟 I'm Kendra Rhodes, and I'm absolutely thrilled to be part of your healing adventure. My mission is to create a warm and judgment-free zone where you can truly be yourself. So, let's embark on this transformative path together! Feel free to share anything, and I'm here to support you every step of the way. Let's make this journey a memorable one! 😊",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Ann Marie Nowak",
    "profile_url": "https://www.rula.com/providers/AL/1720607989-ann-marie-nowak",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/04-08-2025_Ann%2BMarie_Nowak_1720607989",
    "city": "Alabama",
    "bio": "Thank you for reaching out. That first step can be difficult. I am a Licensed Professional Counselor who entered the field late in life. I decided to return to school at age 50 to complete my Master's of Counseling degree. I have been able to take my vast life experiences (mistakes and all!) to help others who may be struggling. I come from a place of total non-judgment and focus on listening to the client and what their needs are. I am an animal lover, spend any leisure time gardening or crafting.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Leslie Hollingsworth Grant",
    "profile_url": "https://www.rula.com/providers/AL/1902450984-leslie-hollingsworth-grant",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/22-09-2025_Leslie_Hollingsworth%2BGrant_1902450984",
    "city": "Huntsville, AL",
    "bio": "I'm a Licensed Independent Clinical Social Worker with over 13 years of experience. I graduated with my master's degree from the University of Alabama. I work mainly with teens and adults. I specialize in assisting clients with several issues that life challenges us with. My goal is to provide a safe space where you can gain clarity, build resilience, and thrive. I utilize many types of interventions, and I use interventions based on each client's particular needs. My goal is to provide a safe space where you can gain clarity, build resilience, and thrive.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Deirdre Rose",
    "profile_url": "https://www.rula.com/providers/AL/1710412200-deirdre-rose",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/20-09-2024_Deirdre_Rose_1710412200",
    "city": "Birmingham, AL",
    "bio": "I am a Licensed Professional Counselor in Alabama with over 20 years of experience in mental health. I offer a compassionate and supportive environment where clients can openly express their struggles. My approach empowers individuals to take control of their lives, guiding them to overcome challenges and achieve personal growth. I am committed to helping clients navigate their circumstances with confidence, fostering a sense of self-awareness and resilience. Through my work, I strive to provide the tools and guidance needed for lasting positive change.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "8+ years"
    ],
    "virtual": false
  },
  {
    "name": "Erica Taylor",
    "profile_url": "https://www.rula.com/providers/AL/1801596093-erica-taylor",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/14-05-2025_Erica_Taylor_1801596093",
    "city": "Birmingham, AL",
    "bio": "Hello! I believe that access to mental health care is important for everyone who needs it. I have worked in mental health for 15 years in various settings, including inpatient and outpatient settings, telehealth settings, and providing mental health case management. Reaching out to a therapist can be scary and a huge, but necessary, step. I appreciate your strength getting this far! I love working alongside people in their life journey to offer support.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Ashley Hix",
    "profile_url": "https://www.rula.com/providers/AL/1861990491-ashley-hix",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/02-12-2024_Ashley_Hix_1861990491",
    "city": "Huntsville, AL",
    "bio": "Greetings! I am an LPC from the state of Alabama. My therapeutic approach is integrative/holistic. Primary areas include trauma, anxiety, depression, and neurodivergence. I am trained in EMDR.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "3+ years",
      "Top provider"
    ],
    "virtual": false
  },
  {
    "name": "Melanie Walton",
    "profile_url": "https://www.rula.com/providers/AL/1700543766-melanie-walton",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/17-09-2025_Melanie_Walton_1700543766",
    "city": "Alabama",
    "bio": "Life is filled with challenges, interpersonal conflict, emotional and physical pain, stress, and loss. No one goes through life unscathed. I heard a wise man say, \"10% of life is what happens to us, the other 90% is how we cope. That's where I come in. My name is Melanie Walton, and I am a Licensed Professional Counselor in Alabama with over 20 years of experience. I've always had a desire to help people, even as a little girl. My motto in life is \"How can I help?\" I have worked with individuals with a wide range of concerns, including substance abuse, anger issues, parenting/co-parenting problems, relationship issues, intimate partner violence, anxiety, depression, and physical/psychological trauma.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Jerusalem Brown",
    "profile_url": "https://www.rula.com/providers/AL/1881360923-jerusalem-brown",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/13-10-2025_Jerusalem_Brown_1881360923",
    "city": "Birmingham, AL",
    "bio": "Good morning, good afternoon, good evening, or good night! I will give you 25 cool points if you tell me where I borrowed that phrase from [insert smiley face here]. I'm Jerusalem Brown, a fully licensed psychotherapist (who also has a therapist), nationally certified counselor, and adjunct psychology instructor. My expertise centers on the lasting effects of early family dysfunction, emotional neglect, and childhood trauma. Even if you excel academically or professionally—embodying resilience and high functionality—you might still face challenges in cultivating healthy interpersonal dynamics. Unfortunately, such struggles can lead to repeated domestic or intimate partner conflicts.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "2+ years",
      "Patient favorite",
      "Top provider"
    ],
    "virtual": false
  },
  {
    "name": "Craig Bynum",
    "profile_url": "https://www.rula.com/providers/AL/1942031299-craig-bynum",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/01-08-2025_Craig_Bynum_1942031299",
    "city": "Alabama",
    "bio": "I am a Licensed Professional Counselor-Supervisor (LPC-S), based in Montgomery, AL, with nearly 30 years of experience. I am passionate about helping people overcome life's struggles and improve their quality of life. For those facing challenges, I encourage you to seek support and work towards a better future.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Brooke Hill",
    "profile_url": "https://www.rula.com/providers/AL/1861986754-brooke-hill",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/18-07-2025_Brooke_Hill_1861986754",
    "city": "Fultondale, AL",
    "bio": "I’m glad you are here. I am a Licensed Independent Clinical Social Worker (LICSW) with 20 years of experience helping others learn how to help themselves. Starting therapy is a big step and can be life-changing. My approach is collaborative and compassionate—I believe the best results come from working together to uncover your strengths, build practical tools, and create lasting change that feels true to you.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Teresa Teer",
    "profile_url": "https://www.rula.com/providers/AL/1760065650-teresa-teer",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/14-10-2025_Teresa_Teer_1760065650",
    "city": "Alabama",
    "bio": "Life can be overwhelming and challenging. We can all benefit from extra support at times. I work with individuals who are navigating life transitions, anxiety, ADHD, ASD, learning, and developmental disorders. If you are struggling to connect to others, managing stress and anxiety, or experiencing transitions, I can help you navigate your journey.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Jewel Euto",
    "profile_url": "https://www.rula.com/providers/AL/1710051974-jewel-euto",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/16-09-2025_Jewel_Euto_1710051974",
    "city": "Alabama",
    "bio": "I am licensed as a Mental Health Counselor and as a Marriage and Family Therapist with certifications in addictions. My approach to therapy is one of a journey to a greater and fulfilling lifestyle.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "32+ years"
    ],
    "virtual": false
  },
  {
    "name": "Sarah Pair",
    "profile_url": "https://www.rula.com/providers/AL/1396104576-sarah-pair",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/22-09-2025_Sarah_Pair_1396104576",
    "city": "Alabama",
    "bio": "I am a Licensed Independent Clinical Social Worker. I work with individuals dealing with various issues related to marriage, parenting difficulties, grief, trauma, anxiety, relationship difficulties, everyday life stress, and difficult life transitions. I meet you where you are without judgment, validating your emotions while working collaboratively with you to support growth, healing, and self-understanding.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Judi Braswell",
    "profile_url": "https://www.rula.com/providers/AL/1679186886-judi-braswell",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/02-09-2025_Judi_Braswell_1679186886",
    "city": "Cropwell, AL",
    "bio": "I am a Christian willing to incorporate biblical principles into the counseling relationship if requested by the client. I strive to meet clients where they are, providing a safe space for being seen and heard. Many of the clients I work with struggle with feelings and behaviors that don't serve them well, but don't know how to make and maintain the changes they desire. Some of my clients enter counseling confused and overwhelmed, unsure of what they do want for their future.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "ShaRetha Williams",
    "profile_url": "https://www.rula.com/providers/AL/1750028460-sharetha-williams",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/15-09-2025_ShaRetha_Williams_1750028460",
    "city": "Madison, AL",
    "bio": "Initiating therapy can feel intimidating; however, it's important to acknowledge that you've already made a big step by considering it. My objective is to assist individuals in achieving healthier and balanced lives. I specialize in supporting clients in managing anxiety and depression, offering a compassionate and tailored approach to mental health care. I have had the privilege of working with diverse populations as they navigate their mental health challenges. My therapeutic approach is integrative and includes, but is not limited to, mindfulness-based techniques, solution-focused strategies, and cognitive behavioral therapy. I invite individuals ready to take the next step toward emotional wellness.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Dashon McNelley",
    "profile_url": "https://www.rula.com/providers/AL/1679165278-dashon-mcnelley",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/12-05-2025_Dashon_McNelley_1679165278",
    "city": "Dothan, AL",
    "bio": "Starting therapy can feel like a big step and can be scary to some. I congratulate you on starting your journey, and I’m here to make sure that it is meaningful to you. I specialize in working with individuals navigating life transitions, anxiety, depression, ADHD, and trauma. I take a client-centered, collaborative approach to therapy, tailoring each session to your unique needs and goals. I welcome you to reach out whenever you feel ready to begin. I’m here to provide a safe and supportive environment where you can be yourself.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "Top provider"
    ],
    "virtual": false
  },
  {
    "name": "Tiffini Chandler",
    "profile_url": "https://www.rula.com/providers/AL/1649963596-tiffini-chandler",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/08-08-2025_Tiffini_Chandler_1649963596",
    "city": "Madison, AL",
    "bio": "Starting therapy can feel like a big step maybe even overwhelming at times but it’s also one of the most rewarding things you can do for your well-being. As your therapist, I strive to offer a genuine and grounded approach to our work together. My goal is to create a safe, supportive space where you can freely explore your thoughts, emotions, and experiences in a way that is both healthy and productive. Throughout your journey, I’ll be here to walk alongside you offering guidance, insight, and encouragement as you grow, heal, and move toward the changes you seek.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Miranda Phillips",
    "profile_url": "https://www.rula.com/providers/AL/1902680721-miranda-phillips",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/30-01-2025_Miranda_Phillips_1902680721",
    "city": "Ariton, AL",
    "bio": "I am a Licensed Professional Counselor, practicing in the state of Alabama. I work with clients statewide via telehealth. I work primarily with adults and specialize in depression, anxiety, mood disorders, substance use disorders, and stress management, using Cognitive Behavioral Therapy and Person-Centered Therapy to help my clients improve their thoughts and feelings.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "2+ years",
      "Top provider"
    ],
    "virtual": false
  },
  {
    "name": "Rashada Smith",
    "profile_url": "https://www.rula.com/providers/AL/1699351247-rashada-smith",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/23-01-2025_Rashada_Smith_1699351247",
    "city": "Wellington, AL",
    "bio": "I am a Licensed Professional Counselor with over 10 years of experience in the mental health field. I am passionate about helping individuals navigate challenges such as anxiety, depression, and personal growth. My approach to therapy is collaborative and empathetic, providing a nonjudgmental space for clients to explore their thoughts, emotions, and behaviors.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "4+ years",
      "Top provider",
      "Relationship builder"
    ],
    "virtual": false
  },
  {
    "name": "Cathy Dulin",
    "profile_url": "https://www.rula.com/providers/AL/1871129155-cathy-dulin",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/28-08-2025_Nichole_Dulin_1871129155",
    "city": "Auburn, AL",
    "bio": "I’m really glad you’re here. I work with clients on challenges like anxiety, depression, and ADHD, and I believe therapy works best when it feels collaborative and real. We’ll find strategies that fit your life and goals. My goal is to create a space where you feel comfortable and supported while we figure things out together.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Catherine Job",
    "profile_url": "https://www.rula.com/providers/AL/1629623939-catherine-job",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/14-04-2025_Catherine_Job_1629623939",
    "city": "Killen, AL",
    "bio": "Life can be difficult at times, and we can all use help navigating the challenges in our lives. Making the decision to start therapy takes courage. I specialize in working with individuals navigating life transitions, anxiety, depression, and grief. I take a client-centered, collaborative approach to therapy, tailoring each session to your unique needs and goals.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "Top provider"
    ],
    "virtual": false
  },
  {
    "name": "Jonathan Williams",
    "profile_url": "https://www.rula.com/providers/AL/1598594731-jonathan-williams",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/20-09-2024_Jonathan_Williams_1598594731",
    "city": "Birmingham, AL",
    "bio": "I am a Licensed Professional Counselor (LPC) and neuropsychotherapist dedicated to helping others navigate life's challenges to find healing and personal growth.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Kelley Mizic",
    "profile_url": "https://www.rula.com/providers/AL/1649460890-kelley-mizic",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/14-04-2025_Kelley_Mizic_1649460890",
    "city": "Anniston, AL",
    "bio": "I am a Licensed Professional Counselor. I work with survivors of domestic violence and or sexual violence, dealing with symptoms of post-traumatic stress Disorder. Although I was trained in Cognitive Behavioral therapy, I prefer to use an eclectic approach to counseling based on the needs of the individual.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Adrienne Cooper",
    "profile_url": "https://www.rula.com/providers/AL/1528507696-adrienne-cooper",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/09-09-2025_Adrienne_Cooper_1528507696",
    "city": "Birmingham, AL",
    "bio": "Congratulations on beginning your therapy journey! My core belief as a counselor is that you have the skills/abilities/strengths to reach your goals and overcome any problem you are experiencing. These \"problems\" or difficulties serve a purpose in your life in helping to develop you into the person you want to become. My role as a counselor is to provide support and guidance along that journey.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Emilio Yonta",
    "profile_url": "https://www.rula.com/providers/AL/1447421201-emilio-yonta",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/12-02-2024_Emilio_Yonta_1447421201",
    "city": "Madison, AL",
    "bio": "Welcome. I am a licensed clinical social worker holding licenses in Florida, Alabama, Tennessee, and South Carolina. I have been in practice for 43 years, with specialties in general mental health and behavioral health problems and challenges. This includes depression, anxiety, adjustment, mood, relationship, and marital problems and concerns. Certifications also in Grief and Loss, Addictions, and Life Coaching.",
    "next_appointment": null,
    "badges": [
      "LICSW",
      "42+ years",
      "Top provider",
      "Relationship builder"
    ],
    "virtual": false
  },
  {
    "name": "Seneithia Parker",
    "profile_url": "https://www.rula.com/providers/AL/1487302097-seneithia-parker",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/14-07-2025_Seneithia_Parker_1487302097",
    "city": "Alabama",
    "bio": "I specialize in working with adults experiencing anxiety, depression, life transitions, and the emotional impact of family and relationship stress. As a Licensed Clinical Social Worker, I bring a warm, client-centered approach to therapy. I often use Cognitive Behavioral Therapy (CBT) to help you understand patterns, build coping skills, and feel more in control of your emotional well-being. My style is collaborative, down-to-earth, and supportive, helping you feel seen and heard in every session. Whether you're adjusting to a new phase of life or carrying the weight of long-standing challenges, I’m here to support your healing and growth. When you're ready, I’m ready to meet you where you are.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Selena Carter",
    "profile_url": "https://www.rula.com/providers/AL/1558898700-selena-carter",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/15-08-2025_Selena_Carter_1558898700",
    "city": "Alabama",
    "bio": "I'm a Licensed Independent Clinical Social Worker with over 13 years of experience helping people navigate life's challenges and transitions. I specialize in supporting mental, emotional, and behavioral well-being, blending evidence-based strategies with practical tools you can use every day. My goal is to create a safe, collaborative space where you feel heard, understood, and empowered to make meaningful changes in your life.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Shawndrika Cook",
    "profile_url": "https://www.rula.com/providers/AL/1649737362-shawndrika-cook",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/24-07-2025_Shawndrika_Cook_1649737362",
    "city": "Birmingham, AL",
    "bio": "Welcome! I’m so glad you’re here. At our practice, we believe in a team-centered approach to healing—where your goals, growth, and well-being are supported not just by one clinician, but by a collaborative team that’s fully invested in your care. From the moment you log on, we work together to build a strong foundation of trust, support, and progress.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Tyler Bryant",
    "profile_url": "https://www.rula.com/providers/AL/1639826167-tyler-bryant",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/07-10-2025_Tyler_Bryant_1639826167",
    "city": "Alabama",
    "bio": "Life has a way of throwing curveballs—sometimes all at once. If you’re feeling stuck, overwhelmed, or simply ready for something different, you’re not alone. I believe therapy should be a place where you can breathe, sort things out, and feel genuinely supported. My approach is collaborative and down-to-earth: we’ll explore what’s weighing on you, uncover your strengths, and take steps toward real, lasting change. You don’t have to have it all figured out before you start—this is exactly where the work begins.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Tristan Rice",
    "profile_url": "https://www.rula.com/providers/AL/1588342786-tristan-rice",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/02-05-2025_Tristan_Rice_1588342786",
    "city": "Fort Payne, AL",
    "bio": "I am a Licensed Clinical Social Worker who is passionate about helping individuals navigate life's challenges and discover their inner strength. With a compassionate and client-centered approach, I support my clients in achieving emotional well-being and personal growth. My goal is to create a safe, welcoming space where you can explore, heal, and thrive.\"",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Veronica Harper",
    "profile_url": "https://www.rula.com/providers/AL/1518431824-veronica-harper",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/30-05-2025_Veronica_Harper_1518431824",
    "city": "Ozark, AL",
    "bio": "I am a Licensed Professional Counselor in the State of Alabama. My approach to counseling includes Cognitive Behavioral Therapy and at some point, I may use the eclectic approach. My areas of focus include anger management, depression, anxiety, grief, stress, and self-esteem.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "3+ years",
      "Top provider",
      "Relationship builder"
    ],
    "virtual": false
  },
  {
    "name": "Michael Murphree",
    "profile_url": "https://www.rula.com/providers/AL/1427138346-michael-murphree",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/18-11-2024_Michael_Murphree_1427138346",
    "city": "Alabama",
    "bio": "Greetings, I am very thankful you are considering this resource. I am an LICSW born and raised in rural Alabama. I believe my mission is to serve on your team and be an active listener, coach, and guide to help you find options that work best for you.",
    "next_appointment": null,
    "badges": [
      "LICSW",
      "32+ years",
      "Top provider",
      "Relationship builder"
    ],
    "virtual": false
  },
  {
    "name": "Francia Haygood",
    "profile_url": "https://www.rula.com/providers/AL/1629697388-francia-haygood",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/06-06-2025_Francia_Haygood_1629697388",
    "city": "Jacksonville, AL",
    "bio": "I am a Licensed Professional Counselor for the state of Alabama as well as a certified School Counselor. I have been practicing and researching in these fields for over 17 years. My focus has been working with diverse individuals and families from diverse backgrounds. I love serving and assisting others and look forward to working with you. Welcome to my practice!",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Britney Harris",
    "profile_url": "https://www.rula.com/providers/AL/1467127712-britney-harris",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/05-09-2025_Britney_Harris_1467127712",
    "city": "Alabama",
    "bio": "I am a Licensed Clinical Social Worker. I provide a supportive and nonjudgmental space where clients can feel heard, valued, and empowered to work through life's challenges. My goal is to help you build practical tools and lasting confidence so you can thrive both emotionally and mentally.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Shelly Taylor",
    "profile_url": "https://www.rula.com/providers/AL/1598645624-shelly-taylor",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/06-10-2025_Shelly_Taylor_1598645624",
    "city": "Alabama",
    "bio": "I am an experienced Licensed Clinical Social Worker practicing in Alabama. My primary goal is to provide evidence-based, client-centered care in a compassionate and safe environment. It is my passion to meet people where they are and provide individualized care specific to their needs.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Ferendez Lowery",
    "profile_url": "https://www.rula.com/providers/AL/1407739154-ferendez-lowery",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/07-08-2025_Ferendez_Lowery_1407739154",
    "city": "Birmingham, AL",
    "bio": "Ferendez Lowery is a Licensed Independent Clinical Social Worker and the founder of Inner Diamond Counseling. We offer compassionate, client-centered support for those navigating life's challenges. The goal is to provide a supportive space to help you journey to inner radiance.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Jasmine Malbreaux",
    "profile_url": "https://www.rula.com/providers/AL/1386240067-jasmine-malbreaux",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/02-09-2025_Jasmine_Malbreaux_1386240067",
    "city": "New Market, AL",
    "bio": "So you have decided to start therapy. I am so proud of you for taking that leap of faith into becoming your best self! I am here to support you in your journey and make it worth your while to better yourself! I specialize in supporting people through life transitions, personal growth, anxiety, and depression. I also have experience working with individuals who are navigating relationship challenges, grief, substance abuse, and more.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Jennessa Crosswy",
    "profile_url": "https://www.rula.com/providers/AL/1417576711-jennessa-crosswy",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/01-08-2025_Jennessa_Crosswy_1417576711",
    "city": "Madison, AL",
    "bio": "I provide teletherapy for teens, adults, couples, and families, specializing in anxiety and depression. With experience across a wide range of mental health challenges, I offer compassionate, goal-oriented support tailored to each client. My mission is to help you overcome obstacles and reach your fullest potential—on your schedule and from the comfort of your own space.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "Top provider"
    ],
    "virtual": false
  },
  {
    "name": "Rachel Roberts",
    "profile_url": "https://www.rula.com/providers/AL/1346916236-rachel-roberts",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/11-08-2025_Rachel_Roberts_1346916236",
    "city": "Birmingham, AL",
    "bio": "I’m a licensed clinical social worker who helps adults navigate life’s professional and personal crossroads. I work with people facing work- and career-related stress, as well as foster and adoptive parents seeking a safe, understanding space to process challenges. My goal is to help you find clarity, confidence, and strategies you can use right away.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Calvin Thomas",
    "profile_url": "https://www.rula.com/providers/AL/1275182156-calvin-thomas",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/29-08-2025_Calvin_Thomas_1275182156",
    "city": "Birmingham, AL",
    "bio": "Greetings, and thank you for taking this step to take care of yourself. Change is not easy, but it is worth it. My hope is that I can partner with you to reach your desired version of success and wellness. I work with different ages and various populations to assist them through the winding paths of life. I utilize a person-centered, strength-based, trauma-informed care approach to connect with individuals challenged with anxiety, depression, trauma, and life changes. I look forward to learning more about you. Please consider scheduling with me soon.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Katelyn Pickett",
    "profile_url": "https://www.rula.com/providers/AL/1346097979-katelyn-pickett",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/22-09-2025_Katelyn_Pickett_1346097979",
    "city": "Alabama",
    "bio": "Life can be tough to navigate alone. It’s a courageous choice to say yes to support. While scary and a bit unsettling, the best gift awaits…deeper access to yourself. It's okay to receive that. If you are experiencing a deep sense of being alone, internal conflict, fear of confronting unsettling thoughts and emotions, or a low sense of self…please know you are not alone. A space to be seen and heard exists that allows you the freedom to honestly explore experiences, wounds, emotions, and thoughts that you might have been convinced needed to stay hidden. The human condition is one we often try to escape. With the right support, escaping subsides, and embracing your authentic journey begins.",
    "next_appointment": null,
    "badges": [
      "LMFT"
    ],
    "virtual": false
  },
  {
    "name": "Aleisha Nesbitt",
    "profile_url": "https://www.rula.com/providers/AL/1356090906-aleisha-nesbitt",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/30-06-2025_Aleisha_Nesbitt_1356090906",
    "city": "Huntsville, AL",
    "bio": "Welcome to a space where real conversations lead to real change. With a direct but supportive approach, I help you navigate the challenges of life. My goal is to expand your capacity for resilience so that you can confidently be the best version of yourself.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Nyx Bellcamp",
    "profile_url": "https://www.rula.com/providers/AL/1417744525-nyx-bellcamp",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/11-08-2025_Nyx_Bellcamp_1417744525",
    "city": "Birmingham, AL",
    "bio": "Starting therapy takes courage, and I'm proud of you for being here. I specialize in working with individuals navigating life transitions of all types. I take a client-centered, collaborative approach to therapy, tailoring each session to your unique needs and goals. I’m here to provide a safe and supportive environment where you can be yourself.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Roy Chambers",
    "profile_url": "https://www.rula.com/providers/AL/1417522236-roy-chambers",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/15-05-2025_Roy_Chambers_1417522236",
    "city": "Birmingham, AL",
    "bio": "\"Do not go where the path may lead, go instead where there is no path and leave a trail.\" - Ralph Waldo Emerson. Hello everyone! I am here to adhere to your unique needs and goals. I will provide a safe and supportive environment to the best of my ability. I work with both kids and adults, but I truly believe that kids are the future! I utilize an eclectic approach towards all clients in order to place the focus on their needs and goals.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Carmen Woods",
    "profile_url": "https://www.rula.com/providers/AL/1366691081-carmen-woods",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/14-08-2025_Carmen_Woods_1366691081",
    "city": "Birmingham, AL",
    "bio": "I am a licensed independent clinical social worker with a supervisor designation. I have more than 12 years of experience in clinical practice.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Pamela Robinson",
    "profile_url": "https://www.rula.com/providers/AL/1346836228-pamela-robinson",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/19-08-2025_Pamela_Robinson_1346836228",
    "city": "Jasper, AL",
    "bio": "I am a licensed professional counselor (LPC). I am also a nationally certified counselor through NBCC. My approach to therapy emphasizes evidence-based practices and trauma-informed care, with a focus on helping children, adolescents, and families who have experienced adverse childhood experiences ( ACEs). In my practice, I specialize in treating: Trauma, Sexual Abuse, Depression, and Problematic sexual behaviors(PSB).",
    "next_appointment": null,
    "badges": [
      "LPC",
      "2+ years"
    ],
    "virtual": false
  },
  {
    "name": "Larry Prentice",
    "profile_url": "https://www.rula.com/providers/AL/1255983862-larry-prentice",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/16-09-2025_Larry_Prentice_1255983862",
    "city": "Alabama",
    "bio": "I am a Licensed Professional Counselor (LPC) and a Nationally Certified Counselor (NCC). I specialize in working with individuals who struggle with trauma, anxiety, mood disorders, anger management, men's issues, career transitions, ADHD, and behavioral challenges.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Percy Storey III",
    "profile_url": "https://www.rula.com/providers/AL/1417502089-percy-storey-iii",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/28-08-2025_Percy_Storey%2BIII_1417502089",
    "city": "Mountain Brook, AL",
    "bio": "Starting therapy is a brave and meaningful step, and I want to first acknowledge the courage it takes to begin this journey. One of the reasons I became a therapist is because I believe so strongly in striving to give clients \"Hope\" even when life feels overwhelming or uncertain. My goal is to help you discover that hope within yourself and to walk alongside you as you work toward healing, growth, and the life you want to create.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Jaana Meeks",
    "profile_url": "https://www.rula.com/providers/AL/1326751306-jaana-meeks",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/20-11-2024_Jaana_Meeks_1326751306",
    "city": "Birmingham, AL",
    "bio": "I have 20 years of experience in the field of Mental/Behavioral Health. I honestly cannot picture myself doing anything else. I realize (from experiences of my own experiences) that deciding to work with a therapist is a tough decision. I will try my best to ease some of that (especially initially) anxiety. We'll go through the process at whatever speed you need/want. Chances are, you have many strengths upon which to build. I strongly believe that therapy is a team approach, and you are the coach.",
    "next_appointment": null,
    "badges": [
      "LICSW",
      "28+ years",
      "Top provider",
      "Relationship builder"
    ],
    "virtual": false
  },
  {
    "name": "Sarah Halligan",
    "profile_url": "https://www.rula.com/providers/AL/1407648090-sarah-halligan",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/20-06-2025_Sarah_Halligan_1407648090",
    "city": "Alabama",
    "bio": "I am a Licensed Independent Clinical Social Worker (LICSW). I take a warm, collaborative approach to therapy, helping clients feel supported while working toward meaningful change. I specialize in working with adults navigating anxiety, depression, grief, life transitions, and the challenges of aging.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  }
]