[
  {
    "name": "Korina Brockhaus",
    "profile_url": "https://www.rula.com/providers/SD/1659047215-korina-brockhaus",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/28-04-2025_Korina_Brockhaus_1659047215",
    "city": "Webster, SD",
    "bio": "Hi! I am currently working with Aspen Counseling Services in Watertown, SD, and online with Rula. I have lived in multiple places across the United States and even Europe (for a very brief moment). So, my childhood and adult experiences are quite unique. I prefer to think that this gives me an enriched perspective that I enjoy bringing into my practice. When I am not spending time with my family, I very much enjoy jumping in on sand or indoor volleyball tournaments, and researching natural health remedies, detox protocols, and tools for my therapy practice.",
    "next_appointment": null,
    "badges": [
      "LMFT"
    ],
    "virtual": false
  },
  {
    "name": "Keley Smith-Keller",
    "profile_url": "https://www.rula.com/providers/SD/1730646191-keley-smith-keller",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/31-05-2025_Keley_Smith-Keller_1730646191",
    "city": "Yankton, SD",
    "bio": "I work with adults in helping them navigate self-doubt, anxiety, and life direction. In our work together, I'll help you discover your skills and personal strengths to make your life more satisfying.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Shane Larson",
    "profile_url": "https://www.rula.com/providers/SD/1679655856-shane-larson",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/22-05-2025_Shane_Larson_1679655856",
    "city": "Sioux Falls, SD",
    "bio": "My name is Shane and I am an experienced Licensed Professional Counselor-Mental Health (LPC-MH) with nearly twenty years of experience.",
    "next_appointment": null,
    "badges": [
      "LPCMH"
    ],
    "virtual": false
  },
  {
    "name": "Kristina Cloutier",
    "profile_url": "https://www.rula.com/providers/SD/1538932314-kristina-cloutier",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/19-05-2025_Kristina_Cloutier_1538932314",
    "city": "Watertown, SD",
    "bio": "I am a licensed professional counselor dedicated to creating a safe, inclusive space for healing and growth. Whether you're new to counseling or returning, I offer a collaborative, client-centered approach to help you navigate anxiety, depression, and life transitions. As a veteran and LGBTQIA+ ally, I'm here to support you, wherever you are on your journey.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "victor bien",
    "profile_url": "https://www.rula.com/providers/SD/1023777612-victor-bien",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/18-02-2025_victor_bien_1023777612",
    "city": "Sioux Falls, SD",
    "bio": "I am a Licensed Professional Counselor in the state of South Dakota, a Nationally Certified Counselor, and a Qualified Mental Health Professional. With four years of professional experience, I specialize in marriage and couples counseling while also addressing a wide range of concerns, including anxiety, depression, and grief/loss. My therapeutic approach integrates evidence-based modalities such as Cognitive Behavioral Therapy (CBT), Dialectical Behavioral Therapy (DBT), Motivational Interviewing (MI), and Solution-Focused Brief Therapy (SFBT) to support individuals and couples in achieving meaningful and lasting change.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "Top provider"
    ],
    "virtual": false
  },
  {
    "name": "Vickie Donohoe",
    "profile_url": "https://www.rula.com/providers/SD/1881572535-vickie-donohoe",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/08-09-2025_Vickie_Donohoe_1881572535",
    "city": "Sioux Falls, SD",
    "bio": "Are you ready for a change but unsure where to start? Whether you're facing a life transition, emotional stress, or just feeling stuck, you don’t have to do it alone. I'm a Licensed Professional Counselor with nearly 30 years of experience supporting individuals and families through growth, healing, and change.",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Tracy Bailey",
    "profile_url": "https://www.rula.com/providers/SD/1700498805-tracy-bailey",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/22-09-2025_Tracy_Bailey_1700498805",
    "city": "Mitchell, SD",
    "bio": "Thanks for being here! I am able to guide and assist you through life challenges; no struggle is too small or too much to reach out for help. I have experienced anxiety, depression, unexpected life changes, and being diagnosed with chronic pain, fatigue, and other conditions. At one time, I was in a place where I didn't think my life could get any better. The therapeutic techniques I used to get where I am now in life are the same evidence-based techniques I utilize in therapy, so you can have an empowered and fulfilling life. My life has always been about working with and helping people. I began coaching and teaching when I was a teenager and continued this career path until I chose to pursue counseling because it meets my desire to help others. The greatest satisfaction",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Becca Dravland",
    "profile_url": "https://www.rula.com/providers/SD/1285349795-becca-dravland",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/03-05-2024_Becca_Dravland_1285349795",
    "city": "Hartford, SD",
    "bio": "I am licensed in South Dakota with over 17 years of professional work experience. I believe in treating everyone with respect, sensitivity, and compassion. I will tailor our dialog and treatment plan to meet your unique and specific needs. Taking the first step to sign up for therapy can take courage, and I am proud of you for getting started!",
    "next_appointment": null,
    "badges": [
      "LPC",
      "13+ years",
      "Top provider",
      "Measures progress"
    ],
    "virtual": false
  },
  {
    "name": "Kelsey Kruse",
    "profile_url": "https://www.rula.com/providers/SD/1306494489-kelsey-kruse",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/30-06-2025_Kelsey_Kruse_1306494489",
    "city": "South Dakota",
    "bio": "I am a seasoned trauma therapist who has been serving the Sioux Falls community for over 10 years, specializing in helping individuals who have endured challenging life experiences. I work with a diverse client base, including pre-teens, teens, and adults, offering tailored therapeutic approaches to promote healing and growth. My expertise includes Parent-Child Interaction Therapy (PCIT), a highly effective treatment for families seeking to improve their relationships. I am trained in Brainspotting, a powerful and focused treatment method that helps clients access, process, and overcome trauma, negative emotions, and pain.",
    "next_appointment": null,
    "badges": [
      "LPCMH"
    ],
    "virtual": false
  }
]