[
  {
    "name": "Jessyca Nellé",
    "profile_url": "https://www.rula.com/providers/VT/1770277469-jessyca-nelle",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/11-06-2025_Jessyca_Nell%25C3%25A9_1770277469",
    "city": "Vermont",
    "bio": "I am a Licensed Clinical Mental Health Counselor with over 15 years of experience supporting children, teens, adults, and families. I am deeply passionate about helping individuals heal from trauma and break cycles that hold them back from living fully. My practice is grounded in compassion, collaboration, and a belief in everyone’s capacity for growth and change. Whether you’re navigating anxiety, family challenges, or the lingering effects of past experiences, I provide a safe, nonjudgmental space where you can feel heard, understood, and empowered to move forward.",
    "next_appointment": null,
    "badges": [
      "LCMHC"
    ],
    "virtual": false
  },
  {
    "name": "Kathleen McIsaac",
    "profile_url": "https://www.rula.com/providers/VT/1619644366-kathleen-mcisaac",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/10-04-2025_Kathleen_McIsaac_1619644366",
    "city": "Bradford, VT",
    "bio": "Hi, I’m Kay McIsaac, a Licensed Clinical Mental Health Counselor and Licensed Alcohol and Drug Counselor servicing New Hampshire, Vermont, and Maine. I offer a supportive, nonjudgmental space where you can explore your story and move toward growth, healing, and change. All people are welcome in my practice, and I strive to create an environment where you feel safe, respected, and totally accepted. I believe therapy isn’t one-size-fits-all—what works for one person may not work for another. Just like finding the right pair of underwear, finding the right therapist is about fit and comfort. If we’re a good match, we’ll work together to meet your goals in a way that feels right for you. And if not, I’ll help guide you to someone who is.",
    "next_appointment": null,
    "badges": [
      "LCMHC"
    ],
    "virtual": false
  },
  {
    "name": "Jodyan Gaynor",
    "profile_url": "https://www.rula.com/providers/VT/1508132630-jodyan-gaynor",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/03-04-2024_Jodyan_Gaynor_1508132630",
    "city": "Vermont",
    "bio": "I am a Licensed Clinical Mental Health Clinician in the state of Vermont. I work with adults and couples experiencing a range of issues, including depression, anxiety, relationship issues, workplace difficulties, and major life transitions. Even positive events can create stressful experiences. I believe our history and cultures are a significant part of who we are, and I am careful to include this in the experiences of how we approach healing and emotional wellbeing.",
    "next_appointment": null,
    "badges": [
      "LCMHC",
      "9+ years",
      "Patient favorite",
      "Trust building"
    ],
    "virtual": false
  },
  {
    "name": "Andrea Carlson",
    "profile_url": "https://www.rula.com/providers/VT/1669270351-andrea-carlson",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/23-04-2025_Andrea_Carlson_1669270351",
    "city": "Vermont",
    "bio": "I’m a Licensed Independent Clinical Social Worker (LICSW) with over 25 years of professional experience supporting high-functioning adolescents and adults with a range of challenges, including depression, anxiety, stress, life transitions, relationship issues, and family pressures. I bring a deep sense of empathy and a nonjudgmental presence to the work I do, and my goal is to offer a welcoming, inclusive environment where you feel safe and heard. I believe in tailoring therapy to each person's unique experiences and aspirations, and I’m here to walk alongside you, whether you’re working through a specific struggle or looking to grow on a personal level.",
    "next_appointment": null,
    "badges": [
      "LICSW"
    ],
    "virtual": false
  },
  {
    "name": "Michele Pilz",
    "profile_url": "https://www.rula.com/providers/VT/1518512193-michele-pilz",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/17-09-2025_Michele_Pilz_1518512193",
    "city": "Rutland, VT",
    "bio": "I am an LCMHC and an LADC in the state of Vermont. I specialize in Trauma-Focused Therapy, Cognitive Behavioral Therapy, and Addiction Therapy. I have an undergraduate degree in English with a concentration in World Literature. I also have a Masters Degree in Clinical Psychology with concentrations in Trauma, Addictions, and Cognitive Behavioral Therapy. My approach is to meet my patients where they are and work with them toward developing the skills and habits that allow them to identify the quality of life they are searching for. We do this mindfully and at whatever pace feels authentic to the patient. I am happy to support my patients in any way that I can, and would be happy to talk about what that might look like, specific to your current challenges.",
    "next_appointment": null,
    "badges": [
      "LCMHC"
    ],
    "virtual": false
  },
  {
    "name": "Leah Oklan",
    "profile_url": "https://www.rula.com/providers/VT/1639328446-leah-oklan",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/31-01-2025_Leah_Oklan_1639328446",
    "city": "Burlington, VT",
    "bio": "I am an LICSW. I offer insight-oriented, psychodynamic psychotherapy and EMDR therapy in a safe, non-judgmental, supportive space where we can focus on the work that feels most important to you.",
    "next_appointment": null,
    "badges": [
      "LICSW",
      "12+ years",
      "Top provider"
    ],
    "virtual": false
  },
  {
    "name": "Pavel Malm",
    "profile_url": "https://www.rula.com/providers/VT/1154425296-pavel-malm",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/28-01-2025_Pavel_Malm_1154425296",
    "city": "Newport, VT",
    "bio": "VT Lic: 068-0000594. I am a humanistic therapist with a behavioristic eye on the future. I use the trust in the relationship to offer a belief and bravery to try new ways of thinking and doing into the future. I work with a variety of clients but have a long history working with youth and their caregivers (ADHD, ODD, Anxiety, Parenting, Autism). Additionally, I work with those experiencing \"transition\", divorce, changing careers, moving out of the country, or even towards independence. etc.",
    "next_appointment": null,
    "badges": [
      "LCMHC",
      "23+ years"
    ],
    "virtual": false
  },
  {
    "name": "Michael Knapik",
    "profile_url": "https://www.rula.com/providers/VT/1982907481-michael-knapik",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/17-03-2025_Michael_Knapik_1982907481",
    "city": "Stowe, VT",
    "bio": "I am a Licensed Clinical Mental Health Counselor in Vermont. I am also certified by the National Board for Certified Counselors. I have been working in the mental health field since 2007. (Before pursuing this career, I was a professional journalist for 30 years, and I have been a hospice volunteer for over 15 years.)",
    "next_appointment": null,
    "badges": [
      "LCMHC"
    ],
    "virtual": false
  },
  {
    "name": "Jennifer DeBarbieri",
    "profile_url": "https://www.rula.com/providers/VT/1649005083-jennifer-debarbieri",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/12-03-2025_Jennifer_DeBarbieri_1649005083",
    "city": "South Burlington, VT",
    "bio": "My approach to therapy emphasizes a compassionate, client-centered, and evidence-based method. I strive to create a safe, supportive environment where individuals can explore their feelings, challenges, and goals.",
    "next_appointment": null,
    "badges": [
      "LCMHC",
      "Relationship builder"
    ],
    "virtual": false
  }
]