[
  {
    "name": "Emily Kirkland-Schiller",
    "profile_url": "https://www.rula.com/providers/WY/1417489162-emily-kirkland-schiller",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/09-01-2025_Emily_Kirkland-Schiller_1417489162",
    "city": "Casper, WY",
    "bio": "I graduated with my Master's in Science in Mental Health Counseling from Walden University in 2017 and have practiced as a therapist since 2017. I am a very kind, empathic, and person-centered therapist. I work to provide an empathic environment to aid in connecting with each client where they are. I am trained in many therapy modalities to support the healing process. I love to work with people who have experienced trauma and grief and want to heal from their difficult life experiences.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "4+ years"
    ],
    "virtual": false
  },
  {
    "name": "Jessica Jaycox",
    "profile_url": "https://www.rula.com/providers/WY/1750941464-jessica-jaycox",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/03-04-2024_Jessica_Jaycox_1750941464",
    "city": "Gillette, WY",
    "bio": "I am a Licensed Clinical Social Worker in the state of Wyoming. I truly believe that you are the expert in your life and that my role is to walk alongside you in your healing journey. I have experience working with a variety of areas, including addiction, trauma, anxiety, depression, grief and body image, and self-esteem.",
    "next_appointment": null,
    "badges": [
      "LCSW",
      "3+ years",
      "Relationship builder",
      "Trust building"
    ],
    "virtual": false
  },
  {
    "name": "Linnea Haun",
    "profile_url": "https://www.rula.com/providers/WY/1386000891-linnea-haun",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/20-03-2025_Linnea_Haun_1386000891",
    "city": "Sheridan, WY",
    "bio": "I am a Licensed Professional Counselor (LPC) in Wyoming. My goal is to provide a warm, supportive space where you feel truly seen and heard. I believe that therapy should be as unique as you are, which is why I take a person-centered approach, tailoring each session to your individual needs, experiences, and personality. Whether you're facing life’s challenges or simply looking for personal growth, I'm here to walk alongside you with compassion and care. I’d love to connect and support you on your journey!",
    "next_appointment": null,
    "badges": [
      "LPC"
    ],
    "virtual": false
  },
  {
    "name": "Meaghan Hennings",
    "profile_url": "https://www.rula.com/providers/WY/1457761686-meaghan-hennings",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/08-11-2024_Meaghan_Hennings_1457761686",
    "city": "Wyoming",
    "bio": "I am a Wyoming Licensed Clinical Social Worker with over 11 years of experience in the mental health field. I believe in a client-centered approach to therapy, meeting all clients where they are at and tailoring treatment to meet individuals' needs.",
    "next_appointment": null,
    "badges": [
      "LCSW",
      "10+ years"
    ],
    "virtual": false
  },
  {
    "name": "Amanda Haight",
    "profile_url": "https://www.rula.com/providers/WY/1033563358-amanda-haight",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/30-05-2024_Amanda_Haight_1033563358",
    "city": "Wyoming",
    "bio": "The journey of 1000 miles begins with a single step. Finding a therapist just might be that first step. I am a licensed clinical psychologist who can help with issues including anger, trauma, depression, anxiety, sleep, adjustment, and relationship issues. In order to help you, I need to understand your strengths and weaknesses, and you have to get to know me as well because, without trust, you're not likely to make much progress. One thing to know about me is that I am a Veteran of the United States Army. If you are ready to start the journey of healing, I would be honored to travel with you.",
    "next_appointment": null,
    "badges": [
      "LP",
      "9+ years",
      "Patient favorite",
      "Top provider"
    ],
    "virtual": false
  },
  {
    "name": "John Stinebaugh",
    "profile_url": "https://www.rula.com/providers/WY/1326470071-john-stinebaugh",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/21-04-2025_John_Stinebaugh_1326470071",
    "city": "Cheyenne, WY",
    "bio": "Therapy can be an intimidating process at first. This is why I specialize in geek therapy, to help you find care and ways to achieve goals that incorporate who you are into the process.",
    "next_appointment": null,
    "badges": [
      "LMFT",
      "Top provider"
    ],
    "virtual": false
  },
  {
    "name": "Karissa Morris",
    "profile_url": "https://www.rula.com/providers/WY/1821449398-karissa-morris",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/04-11-2024_Karissa_Morris_1821449398",
    "city": "Gillette, WY",
    "bio": "I have been a licensed professional counselor (LPC) for 6 years. I believe everyone has the capacity to heal through hard work and taking responsibility for their own truth. I believe in fostering a safe, non-judgmental environment for my clients, allowing them to do the work that allows for growth in a meaningful direction. In my practice, I am committed to building a strong therapeutic relationship and applying interventions that meet the individual needs of my clients.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "5+ years",
      "Top provider"
    ],
    "virtual": false
  },
  {
    "name": "Stephanie Hotaling",
    "profile_url": "https://www.rula.com/providers/WY/1649495565-stephanie-hotaling",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/09-04-2025_Stephanie_Hotaling_1649495565",
    "city": "Wyoming",
    "bio": "Thank you so much for taking the time to get to know me. My name is Stephanie Hotaling LMFT. I have been working as a licensed Marriage and Family therapist for over 25 years in private practice. I live in Fort Collins Colorado and see client's in both Colorado and Wyoming. I truly love my job, and my goal is to empower clients with the tools they need to build healthy, fulfilling relationships and lead balanced lives.",
    "next_appointment": null,
    "badges": [
      "LMFT"
    ],
    "virtual": false
  },
  {
    "name": "Mercedez Velasquez",
    "profile_url": "https://www.rula.com/providers/WY/1346809829-mercedez-velasquez",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/04-08-2025_Mercedez_Velasquez_1346809829",
    "city": "Wyoming",
    "bio": "Therapy is a journey, and I’m here to ensure it’s meaningful and supportive every step of the way. I specialize in working with adults, adolescents, children, and families as they navigate mental health challenges, life transitions, anxiety, depression, and trauma. My approach is client-centered and collaborative, with each session tailored to your unique needs and goals. If and when you feel ready to begin, I welcome you to reach out. You’ll find a safe, non-judgmental space where you can be yourself and feel supported in your growth.",
    "next_appointment": null,
    "badges": [
      "LCSW"
    ],
    "virtual": false
  },
  {
    "name": "Vanessa Fabian",
    "profile_url": "https://www.rula.com/providers/WY/1992292098-vanessa-fabian",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/25-10-2024_Vanessa_Fabian_1992292098",
    "city": "Jackson, WY",
    "bio": "I am a Licensed Clinical Social Worker in both Wyoming and Idaho, with fourteen years of experience in the mental health field. My therapeutic style is holistic, reality-based, experiential, and engaging. My main focus areas are anxiety, depression, trauma, and relationship issues.",
    "next_appointment": null,
    "badges": [
      "LCSW",
      "5+ years"
    ],
    "virtual": false
  },
  {
    "name": "Jill Bashorun",
    "profile_url": "https://www.rula.com/providers/WY/1023262771-jill-bashorun",
    "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/21-04-2025_Jill_Bashorun_1023262771",
    "city": "Wyoming",
    "bio": "I am a Licensed Professional Counselor (LPC). My approach to therapy is working in the here and now, navigating uncharted waters, and walking the changing life journey with clients. I enjoy assisting people with challenges from managing stress, anxiety, depression, coping with grief and loss, relationship issues, parenting, autistic behaviors, defiance, anger, and obsessive thoughts/behaviors. You know and my role is to assist you in being successful, calm, and at a place where you can be at peace.",
    "next_appointment": null,
    "badges": [
      "LPC",
      "Top provider"
    ],
    "virtual": false
  }
]