[
  [
    {
      "name": "Adriana Shipowick",
      "profile_url": "https://www.rula.com/providers/AK/1417757139-adriana-shipowick",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/27-05-2025_Adriana_Shipowick_1417757139",
      "city": "Alaska",
      "bio": "My passion is helping people, and I am dedicated to supporting you on your journey toward mental and emotional well-being.",
      "next_appointment": null,
      "badges": [
        "LCSW"
      ],
      "virtual": false
    },
    {
      "name": "Duncan Brooks",
      "profile_url": "https://www.rula.com/providers/AK/1003135161-duncan-brooks",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/06-01-2025_Duncan_Brooks_1003135161",
      "city": "Anchorage, AK",
      "bio": "I am a licensed professional counselor practicing Emotion-Focused Therapy in Alaska. I have spent the past several years working primarily with couples seeking more connection and intimacy.",
      "next_appointment": null,
      "badges": [
        "LPC",
        "16+ years",
        "Top provider"
      ],
      "virtual": false
    },
    {
      "name": "Marie Lavigne",
      "profile_url": "https://www.rula.com/providers/AK/1306438908-marie-lavigne",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/26-03-2025_Marie_Lavigne_1306438908",
      "city": "Anchorage, AK",
      "bio": "I am a Licensed Clinical Social Worker with over two decades of experience in Alaska as a social worker, with a passion for health and wellness. My approach is compassionate, collaborative, and hopeful. I offer a solution-focused, brief therapy framework to join you in identifying your strengths, to identify solutions, and to support you in making positive life changes that will sustain your mental wellness and bring the joy and passion back into your life.",
      "next_appointment": null,
      "badges": [
        "LCSW",
        "Top provider"
      ],
      "virtual": false
    },
    {
      "name": "Erin Lusk",
      "profile_url": "https://www.rula.com/providers/AK/1285112250-erin-lusk",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/15-05-2025_Erin_Lusk_1285112250",
      "city": "Palmer, AK",
      "bio": "Are you feeling overwhelmed and wondering what life will throw your way next? Feeling anxious, depressed, and worrying or overthinking while you should be sleeping? I am here to show you that you are not alone. Together, we can get you back on track and feeling some relief. I am an Alaskan, member of the LGBTQ community, who works with adults experiencing life transitions, grief, career changes, and more. I use a strength-based and client-centered approach to work towards real solutions so you can feel your best again.",
      "next_appointment": null,
      "badges": [
        "LCSW"
      ],
      "virtual": false
    },
    {
      "name": "Ann Hutcheson",
      "profile_url": "https://www.rula.com/providers/AK/1528231495-ann-hutcheson",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/02-09-2025_Ann_Hutcheson_1528231495",
      "city": "Eagle River, AK",
      "bio": "Whether you are new or returning to therapy, I am here to help work with you on reaching your goals in therapy. I specialize in working with individuals who experiencing PTSD, anxiety, depression, and substance use. My job as a therapist is bring to the table the skills and expertise of research and combine those in a collaborative approach to help clients reach their goals. It can feel overwhelming to reach out for therapy, I would be happy to answer any questions you may have about my approach and therapy in general.",
      "next_appointment": null,
      "badges": [
        "LP"
      ],
      "virtual": false
    },
    {
      "name": "Edmore Mangena",
      "profile_url": "https://www.rula.com/providers/AK/1629291422-edmore-mangena",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/22-07-2024_Edmore_Mangena_1629291422",
      "city": "Valdez, AK",
      "bio": "I am a Licensed Professional Counselor in Alaska. I have practiced in Alaska since 2006, and I have worked with all ages, children and families, individuals, and couples. I use an integrated approach to therapy that is anchored in Cognitive Behavior Therapy. I use person-centered therapy for its emphasis on relationships and existential therapy for its supportive approach. I believe providing clients with a supportive non-judgmental space enables them to work out their issues to resolution or to clarity.",
      "next_appointment": null,
      "badges": [
        "LPC",
        "10+ years",
        "Relationship builder"
      ],
      "virtual": false
    },
    {
      "name": "Lisa Santiago",
      "profile_url": "https://www.rula.com/providers/AK/1184453482-lisa-santiago",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/04-02-2025_Lisa_Santiago_1184453482",
      "city": "Fairbanks, AK",
      "bio": "I am a licensed professional counselor specializing in trauma therapy. I am trained in Eye Movement Desensitization Reprocessing (EMDR), a highly effective approach that helps clients process distressing memories and reframe negative beliefs.",
      "next_appointment": null,
      "badges": [
        "LPC"
      ],
      "virtual": false
    },
    {
      "name": "Michelle Kimbrell",
      "profile_url": "https://www.rula.com/providers/AK/1811761216-michelle-kimbrell",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/07-01-2025_Michelle_Kimbrell_1811761216",
      "city": "Anchorage, AK",
      "bio": "I’m a licensed clinical social worker specializing in health and wellness. My work is rooted in empowering individuals to build resilience and strength through compassionate, strengths-based therapeutic approaches. I integrate a variety of evidence-based theories, including Cognitive Behavioral Therapy and Solution-Focused interventions, to support healing and growth.",
      "next_appointment": null,
      "badges": [
        "LCSW",
        "11+ years",
        "Top provider"
      ],
      "virtual": false
    },
    {
      "name": "Raymond Butts",
      "profile_url": "https://www.rula.com/providers/AK/1548425648-raymond-butts",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/29-08-2025_Raymond_Butts_1548425648",
      "city": "Alaska",
      "bio": "It's so nice to meet you. I am a licensed professional counselor (LPC) and have practiced since 2005 after having come from an educational career of 28 years. I am licensed in Alaska, Missouri, and Maine.",
      "next_appointment": null,
      "badges": [
        "LPC"
      ],
      "virtual": false
    },
    {
      "name": "John Weaver",
      "profile_url": "https://www.rula.com/providers/AK/1386196111-john-weaver",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/27-02-2025_John_Weaver_1386196111",
      "city": "Girdwood, AK",
      "bio": "I am a lifelong Alaskan who has been working in behavioral health since 2006. I graduated from the University of Alaska Anchorage in 2010 with a Master of Social Work Degree and have been a Licensed Clinical Social Worker in the State of Alaska since 2013. I have since worked in the communities of Anchorage, Kodiak, and Girdwood.",
      "next_appointment": null,
      "badges": [
        "LCSW"
      ],
      "virtual": false
    },
    {
      "name": "Khuyen Luu",
      "profile_url": "https://www.rula.com/providers/AK/1548973035-khuyen-luu",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/12-02-2024_Khuyen_Luu_1548973035",
      "city": "Alaska",
      "bio": "I am a Licensed Professional Counselor. I apply a holistic approach to support you in the journey from where you are to where you want to be. The focus of my practice is helping all of my clients to be free from their negative past experiences to live their lives to their full potential.",
      "next_appointment": null,
      "badges": [
        "LPC",
        "5+ years",
        "Trust building"
      ],
      "virtual": false
    },
    {
      "name": "Michelle Lesagonicz",
      "profile_url": "https://www.rula.com/providers/AK/1467990648-michelle-lesagonicz",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/14-10-2024_Michelle_Lesagonicz_1467990648",
      "city": "Soldotna, AK",
      "bio": "I am a licensed clinical social worker in Alaska who has worked with adult individuals for over 10 years. I can teach you ways to manage chronic pain, lower depression and anxiety symptoms, work through traumatic events, and explore changes in your life past and present, all in a supportive, caring, safe, and confidential environment. You can discover ways to make clear, positive decisions and live the life you deserve to live. With support, knowledge, and self-awareness, you can learn how to heal, apply self-empowerment, and add balance to your life. I look forward to working with you.",
      "next_appointment": null,
      "badges": [
        "LCSW",
        "8+ years"
      ],
      "virtual": false
    },
    {
      "name": "Kristina Weltzin",
      "profile_url": "https://www.rula.com/providers/AK/1588432967-kristina-weltzin",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/12-02-2024_Kristina_Weltzin_1588432967",
      "city": "Juneau, AK",
      "bio": "Greetings! I hold a License in Clinical Social Work and have been licensed for over 25 years. I offer brief solution-focused therapy for youth and adults.",
      "next_appointment": null,
      "badges": [
        "LCSW",
        "28+ years",
        "Patient favorite",
        "Top provider"
      ],
      "virtual": false
    },
    {
      "name": "Shelby Thompson",
      "profile_url": "https://www.rula.com/providers/AK/1831667534-shelby-thompson",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/23-04-2025_Shelby_Thompson_1831667534",
      "city": "Alaska",
      "bio": "I am a licensed clinical social worker specializing in helping individuals navigate life’s stressors—whether that’s managing anxiety, healing from trauma, or improving relationships. I provide a compassionate, person-centered approach to therapy, blending evidence-based techniques with genuine human connection.",
      "next_appointment": null,
      "badges": [
        "LCSW"
      ],
      "virtual": false
    },
    {
      "name": "Elena Martin",
      "profile_url": "https://www.rula.com/providers/AK/1588209225-elena-martin",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/20-09-2024_Elena_Martin_1588209225",
      "city": "Ketchikan, AK",
      "bio": "I am a Licensed Professional Counselor (LPC) in the State of Alaska. I have been providing counseling services in Alaska for over 15 years. I have a Master's Degree in Psychology, and I am a Certified Chemical Dependency Counselor (CDCII). I have training in Dialectical Behavioral Therapy (DBT), Cognitive Behavioral Therapy (CBT), MATRIX (evidence-based treatment for addiction), and Love and Logic (Parenting Solutions).",
      "next_appointment": null,
      "badges": [
        "LPC",
        "6+ years"
      ],
      "virtual": false
    },
    {
      "name": "Emma Ayala",
      "profile_url": "https://www.rula.com/providers/AK/1336875103-emma-ayala",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/13-08-2025_Emma_Ayala_1336875103",
      "city": "Juneau, AK",
      "bio": "Have you experienced trauma? Are you feeling stuck, alone, overwhelmed, or unsure where to start? You don’t have to navigate this alone. I am a licensed professional counselor based in Juneau, Alaska. My experience is in working with trauma. I have experience working with teens and adults of all ages. I offer Telehealth services to clients 12 and up and adults of all ages. I look forward to connecting with you",
      "next_appointment": null,
      "badges": [
        "LPC"
      ],
      "virtual": false
    },
    {
      "name": "Philip Andujar",
      "profile_url": "https://www.rula.com/providers/AK/1902505043-philip-andujar",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/08-09-2025_Philip_Andujar_1902505043",
      "city": "Anchorage, AK",
      "bio": "I’m a clinical social worker deeply committed to serving BIPOC and Alaska Native communities through culturally responsive, trauma-informed care. I currently serve as a clinician in Southeast Alaska. Our work together is about finding your way back to yourself. In each session, we’ll make space for softness, for honesty, for breathing room. We’ll explore the stories you carry, the systems that shaped them, and the tools that help you rewrite them. Expect a steady mix of grounded skill-building and soulful reflection, with a focus on healing, not fixing.",
      "next_appointment": null,
      "badges": [
        "LCSW"
      ],
      "virtual": false
    },
    {
      "name": "Brandon Ercanbrack",
      "profile_url": "https://www.rula.com/providers/AK/1093023012-brandon-ercanbrack",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/17-09-2025_Brandon_Ercanbrack_1093023012",
      "city": "Anchorage, AK",
      "bio": "Congrats on taking the first big step in finding wellness. I have always compared my role as your therapist to that of a coach. I am not here to make the plays for you, but I can help you gain invaluable insights so that you can score on the life goals that truly matter to you.",
      "next_appointment": null,
      "badges": [
        "LCSW"
      ],
      "virtual": false
    }
  ],
  [
    {
      "name": "Rebecca Pihl",
      "profile_url": "https://www.rula.com/providers/ND/1407343130-rebecca-pihl",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/16-07-2025_Rebecca_Pihl_1407343130",
      "city": "North Dakota",
      "bio": "I'm glad you're here. Deciding to make changes in your life is hard, and I want to help you meet your goals for your ideal life. I don't believe I know you better than you do on what those goals should be. I imagine my role as a person alongside you, working WITH you. I specialize in depression, anxiety, and other mood disorders, self-harm, and life transitions.",
      "next_appointment": null,
      "badges": [
        "LPCC"
      ],
      "virtual": false
    },
    {
      "name": "Erin Rocheleau",
      "profile_url": "https://www.rula.com/providers/ND/1316496680-erin-rocheleau",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/26-08-2025_Erin_Rocheleau_1316496680",
      "city": "North Dakota",
      "bio": "I am a Licensed Professional Clinical Counselor in the State of North Dakota. I received a Master of Arts Degree in Counseling Psychology along with a Bachelor of Science in Rehabilitation in Human Services, both at the University of North Dakota in Grand Forks.",
      "next_appointment": null,
      "badges": [
        "LPCC"
      ],
      "virtual": false
    },
    {
      "name": "Lisa Martin",
      "profile_url": "https://www.rula.com/providers/ND/1144552761-lisa-martin",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/18-03-2025_Lisa_Martin_1144552761",
      "city": "North Dakota",
      "bio": "I am a licensed clinical social worker with two decades of experience working directly with adult clients in a variety of treatment settings. I am a generalist therapist, and my primary specialties are working with clients who are experiencing depression, anxiety, co-dependency tendencies, grief, and life stressors/transitions.",
      "next_appointment": null,
      "badges": [
        "LCSW"
      ],
      "virtual": false
    },
    {
      "name": "Shone Topham",
      "profile_url": "https://www.rula.com/providers/ND/1174248082-shone-topham",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/15-10-2025_Shone_Topham_1174248082",
      "city": "Minot, ND",
      "bio": "I am a Licensed Clinical Social Worker (LCSW) based in Minot, North Dakota, and I work with clients statewide via telehealth. I work with adults, 18 and over, and specialize in anxiety, anger management, depression, sleep issues, and stress.",
      "next_appointment": null,
      "badges": [
        "LCSW",
        "4+ years"
      ],
      "virtual": false
    },
    {
      "name": "Talitha Schnaidt",
      "profile_url": "https://www.rula.com/providers/ND/1740556414-talitha-schnaidt",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/09-06-2025_Talitha_Schnaidt_1740556414",
      "city": "Grand Forks, ND",
      "bio": "With over 20 years of experience as a licensed mental health therapist, I’ve had the privilege of working with individuals across the lifespan—from children and adolescents to adults and older adults—in a wide range of settings, including schools, community agencies, hospitals, and private practice.",
      "next_appointment": null,
      "badges": [
        "LPCC"
      ],
      "virtual": false
    },
    {
      "name": "Channing Spradling",
      "profile_url": "https://www.rula.com/providers/ND/1396292512-channing-spradling",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/22-05-2025_Channing_Spradling_1396292512",
      "city": "Dickinson, ND",
      "bio": "Whether you’re an individual seeking support for personal growth, managing anxiety, or healing from past trauma, or a couple navigating relationship issues, I’m here to provide guidance and support. I believe that therapy should be a collaborative process where you feel understood, respected, and empowered to make meaningful change.",
      "next_appointment": null,
      "badges": [
        "LCSW"
      ],
      "virtual": false
    },
    {
      "name": "Melony Sanford",
      "profile_url": "https://www.rula.com/providers/ND/1811408974-melony-sanford",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/07-01-2025_Melony_Sanford_1811408974",
      "city": "North Dakota",
      "bio": "I am a licensed professional clinical counselor (LPCC) based in Wyoming, working with clients in the state of North Dakota. I am licensed in both Wyoming and North Dakota to practice therapy. I primarily work with adults and specialize in trauma, depression, anxiety, addiction recovery, and stress management using evidence-based modalities for providing therapy. It is always my goal to be consistently present with clients in the most authentic way possible. Your goals are my goals, in a sense, so achieving recovery can be a very empowering process.",
      "next_appointment": null,
      "badges": [
        "LPCC",
        "6+ years"
      ],
      "virtual": false
    },
    {
      "name": "Jillian Haseleu",
      "profile_url": "https://www.rula.com/providers/ND/1235914185-jillian-haseleu",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/17-10-2025_Jillian_Haseleu_1235914185",
      "city": "Buffalo, ND",
      "bio": "I specialize in mental health counseling for individuals aged 13 and up, offering a compassionate, nonjudgmental environment where clients feel safe to explore their thoughts, emotions, and challenges.",
      "next_appointment": null,
      "badges": [
        "LPCC"
      ],
      "virtual": false
    }
  ],
  [
    {
      "name": "Korina Brockhaus",
      "profile_url": "https://www.rula.com/providers/SD/1659047215-korina-brockhaus",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/28-04-2025_Korina_Brockhaus_1659047215",
      "city": "Webster, SD",
      "bio": "Hi! I am currently working with Aspen Counseling Services in Watertown, SD, and online with Rula. I have lived in multiple places across the United States and even Europe (for a very brief moment). So, my childhood and adult experiences are quite unique. I prefer to think that this gives me an enriched perspective that I enjoy bringing into my practice. When I am not spending time with my family, I very much enjoy jumping in on sand or indoor volleyball tournaments, and researching natural health remedies, detox protocols, and tools for my therapy practice.",
      "next_appointment": null,
      "badges": [
        "LMFT"
      ],
      "virtual": false
    },
    {
      "name": "Keley Smith-Keller",
      "profile_url": "https://www.rula.com/providers/SD/1730646191-keley-smith-keller",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/31-05-2025_Keley_Smith-Keller_1730646191",
      "city": "Yankton, SD",
      "bio": "I work with adults in helping them navigate self-doubt, anxiety, and life direction. In our work together, I'll help you discover your skills and personal strengths to make your life more satisfying.",
      "next_appointment": null,
      "badges": [
        "LPC"
      ],
      "virtual": false
    },
    {
      "name": "Shane Larson",
      "profile_url": "https://www.rula.com/providers/SD/1679655856-shane-larson",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/22-05-2025_Shane_Larson_1679655856",
      "city": "Sioux Falls, SD",
      "bio": "My name is Shane and I am an experienced Licensed Professional Counselor-Mental Health (LPC-MH) with nearly twenty years of experience.",
      "next_appointment": null,
      "badges": [
        "LPCMH"
      ],
      "virtual": false
    },
    {
      "name": "Kristina Cloutier",
      "profile_url": "https://www.rula.com/providers/SD/1538932314-kristina-cloutier",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/19-05-2025_Kristina_Cloutier_1538932314",
      "city": "Watertown, SD",
      "bio": "I am a licensed professional counselor dedicated to creating a safe, inclusive space for healing and growth. Whether you're new to counseling or returning, I offer a collaborative, client-centered approach to help you navigate anxiety, depression, and life transitions. As a veteran and LGBTQIA+ ally, I'm here to support you, wherever you are on your journey.",
      "next_appointment": null,
      "badges": [
        "LPC"
      ],
      "virtual": false
    },
    {
      "name": "victor bien",
      "profile_url": "https://www.rula.com/providers/SD/1023777612-victor-bien",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/18-02-2025_victor_bien_1023777612",
      "city": "Sioux Falls, SD",
      "bio": "I am a Licensed Professional Counselor in the state of South Dakota, a Nationally Certified Counselor, and a Qualified Mental Health Professional. With four years of professional experience, I specialize in marriage and couples counseling while also addressing a wide range of concerns, including anxiety, depression, and grief/loss. My therapeutic approach integrates evidence-based modalities such as Cognitive Behavioral Therapy (CBT), Dialectical Behavioral Therapy (DBT), Motivational Interviewing (MI), and Solution-Focused Brief Therapy (SFBT) to support individuals and couples in achieving meaningful and lasting change.",
      "next_appointment": null,
      "badges": [
        "LPC",
        "Top provider"
      ],
      "virtual": false
    },
    {
      "name": "Vickie Donohoe",
      "profile_url": "https://www.rula.com/providers/SD/1881572535-vickie-donohoe",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/08-09-2025_Vickie_Donohoe_1881572535",
      "city": "Sioux Falls, SD",
      "bio": "Are you ready for a change but unsure where to start? Whether you're facing a life transition, emotional stress, or just feeling stuck, you don’t have to do it alone. I'm a Licensed Professional Counselor with nearly 30 years of experience supporting individuals and families through growth, healing, and change.",
      "next_appointment": null,
      "badges": [
        "LPC"
      ],
      "virtual": false
    },
    {
      "name": "Tracy Bailey",
      "profile_url": "https://www.rula.com/providers/SD/1700498805-tracy-bailey",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/22-09-2025_Tracy_Bailey_1700498805",
      "city": "Mitchell, SD",
      "bio": "Thanks for being here! I am able to guide and assist you through life challenges; no struggle is too small or too much to reach out for help. I have experienced anxiety, depression, unexpected life changes, and being diagnosed with chronic pain, fatigue, and other conditions. At one time, I was in a place where I didn't think my life could get any better. The therapeutic techniques I used to get where I am now in life are the same evidence-based techniques I utilize in therapy, so you can have an empowered and fulfilling life. My life has always been about working with and helping people. I began coaching and teaching when I was a teenager and continued this career path until I chose to pursue counseling because it meets my desire to help others. The greatest satisfaction",
      "next_appointment": null,
      "badges": [
        "LPC"
      ],
      "virtual": false
    },
    {
      "name": "Becca Dravland",
      "profile_url": "https://www.rula.com/providers/SD/1285349795-becca-dravland",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/03-05-2024_Becca_Dravland_1285349795",
      "city": "Hartford, SD",
      "bio": "I am licensed in South Dakota with over 17 years of professional work experience. I believe in treating everyone with respect, sensitivity, and compassion. I will tailor our dialog and treatment plan to meet your unique and specific needs. Taking the first step to sign up for therapy can take courage, and I am proud of you for getting started!",
      "next_appointment": null,
      "badges": [
        "LPC",
        "13+ years",
        "Top provider",
        "Measures progress"
      ],
      "virtual": false
    },
    {
      "name": "Kelsey Kruse",
      "profile_url": "https://www.rula.com/providers/SD/1306494489-kelsey-kruse",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/30-06-2025_Kelsey_Kruse_1306494489",
      "city": "South Dakota",
      "bio": "I am a seasoned trauma therapist who has been serving the Sioux Falls community for over 10 years, specializing in helping individuals who have endured challenging life experiences. I work with a diverse client base, including pre-teens, teens, and adults, offering tailored therapeutic approaches to promote healing and growth. My expertise includes Parent-Child Interaction Therapy (PCIT), a highly effective treatment for families seeking to improve their relationships. I am trained in Brainspotting, a powerful and focused treatment method that helps clients access, process, and overcome trauma, negative emotions, and pain.",
      "next_appointment": null,
      "badges": [
        "LPCMH"
      ],
      "virtual": false
    }
  ],
  [
    {
      "name": "Jessyca Nellé",
      "profile_url": "https://www.rula.com/providers/VT/1770277469-jessyca-nelle",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/11-06-2025_Jessyca_Nell%25C3%25A9_1770277469",
      "city": "Vermont",
      "bio": "I am a Licensed Clinical Mental Health Counselor with over 15 years of experience supporting children, teens, adults, and families. I am deeply passionate about helping individuals heal from trauma and break cycles that hold them back from living fully. My practice is grounded in compassion, collaboration, and a belief in everyone’s capacity for growth and change. Whether you’re navigating anxiety, family challenges, or the lingering effects of past experiences, I provide a safe, nonjudgmental space where you can feel heard, understood, and empowered to move forward.",
      "next_appointment": null,
      "badges": [
        "LCMHC"
      ],
      "virtual": false
    },
    {
      "name": "Kathleen McIsaac",
      "profile_url": "https://www.rula.com/providers/VT/1619644366-kathleen-mcisaac",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/10-04-2025_Kathleen_McIsaac_1619644366",
      "city": "Bradford, VT",
      "bio": "Hi, I’m Kay McIsaac, a Licensed Clinical Mental Health Counselor and Licensed Alcohol and Drug Counselor servicing New Hampshire, Vermont, and Maine. I offer a supportive, nonjudgmental space where you can explore your story and move toward growth, healing, and change. All people are welcome in my practice, and I strive to create an environment where you feel safe, respected, and totally accepted. I believe therapy isn’t one-size-fits-all—what works for one person may not work for another. Just like finding the right pair of underwear, finding the right therapist is about fit and comfort. If we’re a good match, we’ll work together to meet your goals in a way that feels right for you. And if not, I’ll help guide you to someone who is.",
      "next_appointment": null,
      "badges": [
        "LCMHC"
      ],
      "virtual": false
    },
    {
      "name": "Jodyan Gaynor",
      "profile_url": "https://www.rula.com/providers/VT/1508132630-jodyan-gaynor",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/03-04-2024_Jodyan_Gaynor_1508132630",
      "city": "Vermont",
      "bio": "I am a Licensed Clinical Mental Health Clinician in the state of Vermont. I work with adults and couples experiencing a range of issues, including depression, anxiety, relationship issues, workplace difficulties, and major life transitions. Even positive events can create stressful experiences. I believe our history and cultures are a significant part of who we are, and I am careful to include this in the experiences of how we approach healing and emotional wellbeing.",
      "next_appointment": null,
      "badges": [
        "LCMHC",
        "9+ years",
        "Patient favorite",
        "Trust building"
      ],
      "virtual": false
    },
    {
      "name": "Andrea Carlson",
      "profile_url": "https://www.rula.com/providers/VT/1669270351-andrea-carlson",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/23-04-2025_Andrea_Carlson_1669270351",
      "city": "Vermont",
      "bio": "I’m a Licensed Independent Clinical Social Worker (LICSW) with over 25 years of professional experience supporting high-functioning adolescents and adults with a range of challenges, including depression, anxiety, stress, life transitions, relationship issues, and family pressures. I bring a deep sense of empathy and a nonjudgmental presence to the work I do, and my goal is to offer a welcoming, inclusive environment where you feel safe and heard. I believe in tailoring therapy to each person's unique experiences and aspirations, and I’m here to walk alongside you, whether you’re working through a specific struggle or looking to grow on a personal level.",
      "next_appointment": null,
      "badges": [
        "LICSW"
      ],
      "virtual": false
    },
    {
      "name": "Michele Pilz",
      "profile_url": "https://www.rula.com/providers/VT/1518512193-michele-pilz",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/17-09-2025_Michele_Pilz_1518512193",
      "city": "Rutland, VT",
      "bio": "I am an LCMHC and an LADC in the state of Vermont. I specialize in Trauma-Focused Therapy, Cognitive Behavioral Therapy, and Addiction Therapy. I have an undergraduate degree in English with a concentration in World Literature. I also have a Masters Degree in Clinical Psychology with concentrations in Trauma, Addictions, and Cognitive Behavioral Therapy. My approach is to meet my patients where they are and work with them toward developing the skills and habits that allow them to identify the quality of life they are searching for. We do this mindfully and at whatever pace feels authentic to the patient. I am happy to support my patients in any way that I can, and would be happy to talk about what that might look like, specific to your current challenges.",
      "next_appointment": null,
      "badges": [
        "LCMHC"
      ],
      "virtual": false
    },
    {
      "name": "Leah Oklan",
      "profile_url": "https://www.rula.com/providers/VT/1639328446-leah-oklan",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/31-01-2025_Leah_Oklan_1639328446",
      "city": "Burlington, VT",
      "bio": "I am an LICSW. I offer insight-oriented, psychodynamic psychotherapy and EMDR therapy in a safe, non-judgmental, supportive space where we can focus on the work that feels most important to you.",
      "next_appointment": null,
      "badges": [
        "LICSW",
        "12+ years",
        "Top provider"
      ],
      "virtual": false
    },
    {
      "name": "Pavel Malm",
      "profile_url": "https://www.rula.com/providers/VT/1154425296-pavel-malm",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/28-01-2025_Pavel_Malm_1154425296",
      "city": "Newport, VT",
      "bio": "VT Lic: 068-0000594. I am a humanistic therapist with a behavioristic eye on the future. I use the trust in the relationship to offer a belief and bravery to try new ways of thinking and doing into the future. I work with a variety of clients but have a long history working with youth and their caregivers (ADHD, ODD, Anxiety, Parenting, Autism). Additionally, I work with those experiencing \"transition\", divorce, changing careers, moving out of the country, or even towards independence. etc.",
      "next_appointment": null,
      "badges": [
        "LCMHC",
        "23+ years"
      ],
      "virtual": false
    },
    {
      "name": "Michael Knapik",
      "profile_url": "https://www.rula.com/providers/VT/1982907481-michael-knapik",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/17-03-2025_Michael_Knapik_1982907481",
      "city": "Stowe, VT",
      "bio": "I am a Licensed Clinical Mental Health Counselor in Vermont. I am also certified by the National Board for Certified Counselors. I have been working in the mental health field since 2007. (Before pursuing this career, I was a professional journalist for 30 years, and I have been a hospice volunteer for over 15 years.)",
      "next_appointment": null,
      "badges": [
        "LCMHC"
      ],
      "virtual": false
    },
    {
      "name": "Jennifer DeBarbieri",
      "profile_url": "https://www.rula.com/providers/VT/1649005083-jennifer-debarbieri",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/12-03-2025_Jennifer_DeBarbieri_1649005083",
      "city": "South Burlington, VT",
      "bio": "My approach to therapy emphasizes a compassionate, client-centered, and evidence-based method. I strive to create a safe, supportive environment where individuals can explore their feelings, challenges, and goals.",
      "next_appointment": null,
      "badges": [
        "LCMHC",
        "Relationship builder"
      ],
      "virtual": false
    }
  ],
  [
    {
      "name": "Emily Kirkland-Schiller",
      "profile_url": "https://www.rula.com/providers/WY/1417489162-emily-kirkland-schiller",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/09-01-2025_Emily_Kirkland-Schiller_1417489162",
      "city": "Casper, WY",
      "bio": "I graduated with my Master's in Science in Mental Health Counseling from Walden University in 2017 and have practiced as a therapist since 2017. I am a very kind, empathic, and person-centered therapist. I work to provide an empathic environment to aid in connecting with each client where they are. I am trained in many therapy modalities to support the healing process. I love to work with people who have experienced trauma and grief and want to heal from their difficult life experiences.",
      "next_appointment": null,
      "badges": [
        "LPC",
        "4+ years"
      ],
      "virtual": false
    },
    {
      "name": "Jessica Jaycox",
      "profile_url": "https://www.rula.com/providers/WY/1750941464-jessica-jaycox",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/03-04-2024_Jessica_Jaycox_1750941464",
      "city": "Gillette, WY",
      "bio": "I am a Licensed Clinical Social Worker in the state of Wyoming. I truly believe that you are the expert in your life and that my role is to walk alongside you in your healing journey. I have experience working with a variety of areas, including addiction, trauma, anxiety, depression, grief and body image, and self-esteem.",
      "next_appointment": null,
      "badges": [
        "LCSW",
        "3+ years",
        "Relationship builder",
        "Trust building"
      ],
      "virtual": false
    },
    {
      "name": "Linnea Haun",
      "profile_url": "https://www.rula.com/providers/WY/1386000891-linnea-haun",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/20-03-2025_Linnea_Haun_1386000891",
      "city": "Sheridan, WY",
      "bio": "I am a Licensed Professional Counselor (LPC) in Wyoming. My goal is to provide a warm, supportive space where you feel truly seen and heard. I believe that therapy should be as unique as you are, which is why I take a person-centered approach, tailoring each session to your individual needs, experiences, and personality. Whether you're facing life’s challenges or simply looking for personal growth, I'm here to walk alongside you with compassion and care. I’d love to connect and support you on your journey!",
      "next_appointment": null,
      "badges": [
        "LPC"
      ],
      "virtual": false
    },
    {
      "name": "Meaghan Hennings",
      "profile_url": "https://www.rula.com/providers/WY/1457761686-meaghan-hennings",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/08-11-2024_Meaghan_Hennings_1457761686",
      "city": "Wyoming",
      "bio": "I am a Wyoming Licensed Clinical Social Worker with over 11 years of experience in the mental health field. I believe in a client-centered approach to therapy, meeting all clients where they are at and tailoring treatment to meet individuals' needs.",
      "next_appointment": null,
      "badges": [
        "LCSW",
        "10+ years"
      ],
      "virtual": false
    },
    {
      "name": "Amanda Haight",
      "profile_url": "https://www.rula.com/providers/WY/1033563358-amanda-haight",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/30-05-2024_Amanda_Haight_1033563358",
      "city": "Wyoming",
      "bio": "The journey of 1000 miles begins with a single step. Finding a therapist just might be that first step. I am a licensed clinical psychologist who can help with issues including anger, trauma, depression, anxiety, sleep, adjustment, and relationship issues. In order to help you, I need to understand your strengths and weaknesses, and you have to get to know me as well because, without trust, you're not likely to make much progress. One thing to know about me is that I am a Veteran of the United States Army. If you are ready to start the journey of healing, I would be honored to travel with you.",
      "next_appointment": null,
      "badges": [
        "LP",
        "9+ years",
        "Patient favorite",
        "Top provider"
      ],
      "virtual": false
    },
    {
      "name": "John Stinebaugh",
      "profile_url": "https://www.rula.com/providers/WY/1326470071-john-stinebaugh",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/21-04-2025_John_Stinebaugh_1326470071",
      "city": "Cheyenne, WY",
      "bio": "Therapy can be an intimidating process at first. This is why I specialize in geek therapy, to help you find care and ways to achieve goals that incorporate who you are into the process.",
      "next_appointment": null,
      "badges": [
        "LMFT",
        "Top provider"
      ],
      "virtual": false
    },
    {
      "name": "Karissa Morris",
      "profile_url": "https://www.rula.com/providers/WY/1821449398-karissa-morris",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/04-11-2024_Karissa_Morris_1821449398",
      "city": "Gillette, WY",
      "bio": "I have been a licensed professional counselor (LPC) for 6 years. I believe everyone has the capacity to heal through hard work and taking responsibility for their own truth. I believe in fostering a safe, non-judgmental environment for my clients, allowing them to do the work that allows for growth in a meaningful direction. In my practice, I am committed to building a strong therapeutic relationship and applying interventions that meet the individual needs of my clients.",
      "next_appointment": null,
      "badges": [
        "LPC",
        "5+ years",
        "Top provider"
      ],
      "virtual": false
    },
    {
      "name": "Stephanie Hotaling",
      "profile_url": "https://www.rula.com/providers/WY/1649495565-stephanie-hotaling",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/09-04-2025_Stephanie_Hotaling_1649495565",
      "city": "Wyoming",
      "bio": "Thank you so much for taking the time to get to know me. My name is Stephanie Hotaling LMFT. I have been working as a licensed Marriage and Family therapist for over 25 years in private practice. I live in Fort Collins Colorado and see client's in both Colorado and Wyoming. I truly love my job, and my goal is to empower clients with the tools they need to build healthy, fulfilling relationships and lead balanced lives.",
      "next_appointment": null,
      "badges": [
        "LMFT"
      ],
      "virtual": false
    },
    {
      "name": "Mercedez Velasquez",
      "profile_url": "https://www.rula.com/providers/WY/1346809829-mercedez-velasquez",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/04-08-2025_Mercedez_Velasquez_1346809829",
      "city": "Wyoming",
      "bio": "Therapy is a journey, and I’m here to ensure it’s meaningful and supportive every step of the way. I specialize in working with adults, adolescents, children, and families as they navigate mental health challenges, life transitions, anxiety, depression, and trauma. My approach is client-centered and collaborative, with each session tailored to your unique needs and goals. If and when you feel ready to begin, I welcome you to reach out. You’ll find a safe, non-judgmental space where you can be yourself and feel supported in your growth.",
      "next_appointment": null,
      "badges": [
        "LCSW"
      ],
      "virtual": false
    },
    {
      "name": "Vanessa Fabian",
      "profile_url": "https://www.rula.com/providers/WY/1992292098-vanessa-fabian",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/25-10-2024_Vanessa_Fabian_1992292098",
      "city": "Jackson, WY",
      "bio": "I am a Licensed Clinical Social Worker in both Wyoming and Idaho, with fourteen years of experience in the mental health field. My therapeutic style is holistic, reality-based, experiential, and engaging. My main focus areas are anxiety, depression, trauma, and relationship issues.",
      "next_appointment": null,
      "badges": [
        "LCSW",
        "5+ years"
      ],
      "virtual": false
    },
    {
      "name": "Jill Bashorun",
      "profile_url": "https://www.rula.com/providers/WY/1023262771-jill-bashorun",
      "image": "https://provider-headshots.s3.us-west-2.amazonaws.com/21-04-2025_Jill_Bashorun_1023262771",
      "city": "Wyoming",
      "bio": "I am a Licensed Professional Counselor (LPC). My approach to therapy is working in the here and now, navigating uncharted waters, and walking the changing life journey with clients. I enjoy assisting people with challenges from managing stress, anxiety, depression, coping with grief and loss, relationship issues, parenting, autistic behaviors, defiance, anger, and obsessive thoughts/behaviors. You know and my role is to assist you in being successful, calm, and at a place where you can be at peace.",
      "next_appointment": null,
      "badges": [
        "LPC",
        "Top provider"
      ],
      "virtual": false
    }
  ]
]